UI/Market/src/main/java/daniel/biniek/Request/getProducts.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:prod="http://Product.biniek.daniel/">
    <soapenv:Header/>
    <soapenv:Body>
        <prod:getProducts/>
    </soapenv:Body>
</soapenv:Envelope>